; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-9)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(free left)
(free right)
(at ball1 rooma)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room3)
(at ball8 room4)
(at ball9 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 room5)
(at ball2 room5)
(at ball3 room5)
(at ball4 room5)
(at ball5 room5)
(at ball6 room5)
(at ball7 room5)
(at ball8 room5)
(at ball9 room5)
)
)
)

; plan
1. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 0 of 9
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 0 of 9
3. (pick ball6 roomb right)
   deleted: (at ball6 roomb) (free right)
   added: (carry ball6 right)
   goals met: 0 of 9
4. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 0 of 9
5. (drop ball6 room5 right)
   deleted: (carry ball6 right)
   added: (at ball6 room5) (free right)
   goals met: 1 of 9
6. (drop ball1 room5 left)
   deleted: (carry ball1 left)
   added: (at ball1 room5) (free left)
   goals met: 2 of 9
7. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 2 of 9
8. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 2 of 9
9. (pick ball4 roomb right)
   deleted: (at ball4 roomb) (free right)
   added: (carry ball4 right)
   goals met: 2 of 9
10. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 2 of 9
11. (drop ball4 room5 right)
   deleted: (carry ball4 right)
   added: (at ball4 room5) (free right)
   goals met: 3 of 9
12. (drop ball5 room5 left)
   deleted: (carry ball5 left)
   added: (at ball5 room5) (free left)
   goals met: 4 of 9
13. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 4 of 9
14. (pick ball3 roomb left)
   deleted: (at ball3 roomb) (free left)
   added: (carry ball3 left)
   goals met: 4 of 9
15. (pick ball2 roomb right)
   deleted: (at ball2 roomb) (free right)
   added: (carry ball2 right)
   goals met: 4 of 9
16. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 4 of 9
17. (drop ball2 room5 right)
   deleted: (carry ball2 right)
   added: (at ball2 room5) (free right)
   goals met: 5 of 9
18. (drop ball3 room5 left)
   deleted: (carry ball3 left)
   added: (at ball3 room5) (free left)
   goals met: 6 of 9
19. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 6 of 9
20. (pick ball9 room4 left)
   deleted: (at ball9 room4) (free left)
   added: (carry ball9 left)
   goals met: 6 of 9
21. (pick ball8 room4 right)
   deleted: (at ball8 room4) (free right)
   added: (carry ball8 right)
   goals met: 6 of 9
22. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 6 of 9
23. (drop ball8 room5 right)
   deleted: (carry ball8 right)
   added: (at ball8 room5) (free right)
   goals met: 7 of 9
24. (drop ball9 room5 left)
   deleted: (carry ball9 left)
   added: (at ball9 room5) (free left)
   goals met: 8 of 9
25. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 8 of 9
26. (pick ball7 room3 left)
   deleted: (at ball7 room3) (free left)
   added: (carry ball7 left)
   goals met: 8 of 9
27. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 8 of 9
28. (drop ball7 room5 left)
   deleted: (carry ball7 left)
   added: (at ball7 room5) (free left)
   goals met: 9 of 9
